node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "img_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
        tensor_content: ")\\\367B\331\216\351B\305\340\317B"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "Placeholder"
  input: "img_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
        tensor_content: "{\224iB\341zdB\000\200eB"
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "sub"
  input: "Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0833333358168602
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal"
  op: "AddV2"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/mul"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/conv2d/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Initializer/random_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/conv2d/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/conv2d/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/conv2d/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/conv2d/Conv2D"
  op: "Conv2D"
  input: "truediv"
  input: "efficientnet/efficientnet-b0/model/stem/conv2d/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet/efficientnet-b0/model/stem/conv2d/Conv2D"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/ReadVariableOp"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/ReadVariableOp_1"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet/efficientnet-b0/model/stem/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/Identity"
  op: "Identity"
  input: "efficientnet/efficientnet-b0/model/stem/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/stem/IdentityN"
  op: "IdentityN"
  input: "efficientnet/efficientnet-b0/model/stem/mul"
  input: "efficientnet/efficientnet-b0/model/stem/tpu_batch_normalization/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_gradient_op_type"
    value {
      s: "CustomGradient-37298"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.4714045226573944
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal"
  op: "AddV2"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/mul"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Initializer/random_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet/efficientnet-b0/model/stem/IdentityN"
  input: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet/efficientnet-b0/model/blocks_0/depthwise_conv2d/depthwise"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/ReadVariableOp"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/ReadVariableOp_1"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet/efficientnet-b0/model/blocks_0/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/Identity"
  op: "Identity"
  input: "efficientnet/efficientnet-b0/model/blocks_0/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/IdentityN"
  op: "IdentityN"
  input: "efficientnet/efficientnet-b0/model/blocks_0/mul"
  input: "efficientnet/efficientnet-b0/model/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_gradient_op_type"
    value {
      s: "CustomGradient-37343"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/Mean"
  op: "Mean"
  input: "efficientnet/efficientnet-b0/model/blocks_0/IdentityN"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000 \000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/RandomStandardNormal"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal"
  op: "AddV2"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/mul"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Initializer/random_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias/Assign"
  op: "AssignVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/Mean"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "efficientnet/efficientnet-b0/blocks_0/se/conv2d/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/Conv2D"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/mul"
  op: "Mul"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/Identity"
  op: "Identity"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/model/blocks_0/se/IdentityN"
  op: "IdentityN"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/mul"
  input: "efficientnet/efficientnet-b0/model/blocks_0/se/conv2d/BiasAdd"
  attr {
    key: "T"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_gradient_op_type"
    value {
      s: "CustomGradient-37368"
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d_1/kernel/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\010\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "efficientnet/efficientnet-b0/blocks_0/se/conv2d_1/kernel/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@efficientnet/efficientnet-b0/blocks_0/se/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
